In [68]:
# Dependencies
# ----------------------------------
# Imports the method used for connecting to DBs
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker
from sqlalchemy import MetaData
from sqlalchemy.orm import mapper
from config import password

# Imports the methods needed to abstract classes into tables
from sqlalchemy.ext.declarative import declarative_base

# Allow us to declare column types
from sqlalchemy import Column, Integer, String, Float 

import pandas as pd

In [100]:
path = "cleaned_data/gender_race.csv"
pay_gap_by_gender_table = pd.read_csv(path, encoding="UTF-8")
pay_gap_by_gender_table.index.name = 'id'
pay_gap_by_gender_table.head()

   categoryindex category  total_workers  median_weekly_earnings  year
id
0          Total    Total         113272                     860  2017
1      Total_Men      Men          62980                     941  2017
2    Total_Women    Women          50291                     770  2017
3    White_Total    White          87730                     890  2017
4      White_Men      Men          50003                     971  2017

In [102]:
engine = create_engine('postgresql://postgres:'+ 'database' + '@localhost:5432/gender_pay_gap')

In [103]:
#engine.table_names()
metadata = MetaData()
metadata.reflect(bind=engine)
print(metadata.tables)

immutabledict({'pay_gap_by_race': Table('pay_gap_by_race', MetaData(bind=None), Column('id', INTEGER(), table=<pay_gap_by_race>, primary_key=True, nullable=False), Column('categoryindex', VARCHAR(length=50), table=<pay_gap_by_race>, nullable=False), Column('category', VARCHAR(length=50), table=<pay_gap_by_race>), Column('total_workers', INTEGER(), table=<pay_gap_by_race>), Column('median_weekly_earnings', INTEGER(), table=<pay_gap_by_race>), Column('year', INTEGER(), table=<pay_gap_by_race>), schema=None), 'pay_gap_by_education': Table('pay_gap_by_education', MetaData(bind=None), Column('id', INTEGER(), table=<pay_gap_by_education>, primary_key=True, nullable=False), Column('education_level', VARCHAR(length=50), table=<pay_gap_by_education>, nullable=False), Column('median_weekly_earnings_in_2018', INTEGER(), table=<pay_gap_by_education>), Column('median_weekly_earnings_in_2017', INTEGER(), table=<pay_gap_by_education>), Column('median_weekly_earnings_in_2016', INTEGER(), table=<pay_gap_by_education>), Column('gender', VARCHAR(length=50), table=<pay_gap_by_education>), schema=None)})

In [105]:
pay_gap_by_gender_table.to_sql(name='pay_gap_by_race', con=engine, if_exists='append', index=True)

In [106]:
path_1 = "cleaned_data/by_education_2016-2018.csv"
pay_gap_by_education = pd.read_csv(path_1, encoding="UTF-8")
pay_gap_by_education.index.name = 'id'
pay_gap_by_education.head()

,By education,Median weekly earnings in 2018,Median weekly earnings in 2017,Median weekly earnings in 2016,Gender
id,,,,,
0,"Men, 25 years and over",1026,996,969,Male
1,Less than a high school diploma,607,584,551,Male
2,"High school graduates, no college(3)",819,797,769,Male
3,Some college or associate degree,951,917,896,Male
4,"Some college, no degree",918,886,861,Male

In [107]:
pay_gap_by_education = pay_gap_by_education.rename(columns ={'By education': 'education_level',
                               'Median weekly earnings in 2018': 'median_weekly_earnings_in_2018',
                               'Median weekly earnings in 2017': 'median_weekly_earnings_in_2017',
                               'Median weekly earnings in 2016': 'median_weekly_earnings_in_2016',
                                                            'Gender':'gender'})
pay_gap_by_education.head()

,education_level,median_weekly_earnings_in_2018,median_weekly_earnings_in_2017,median_weekly_earnings_in_2016,gender
id,,,,,
0,"Men, 25 years and over",1026,996,969,Male
1,Less than a high school diploma,607,584,551,Male
2,"High school graduates, no college(3)",819,797,769,Male
3,Some college or associate degree,951,917,896,Male
4,"Some college, no degree",918,886,861,Male

In [108]:
pay_gap_by_education.dtypes

education_level                   object
median_weekly_earnings_in_2018     int64
median_weekly_earnings_in_2017     int64
median_weekly_earnings_in_2016     int64
gender                            object
dtype: object

In [109]:
 # Use pd.to_numeric() method to convert the datatype of the Amount column
pay_gap_by_education['median_weekly_earnings_in_2018'] = pd.to_numeric(pay_gap_by_education['median_weekly_earnings_in_2018'])

In [110]:
list(pay_gap_by_education.columns)

['education_level',
 'median_weekly_earnings_in_2018',
 'median_weekly_earnings_in_2017',
 'median_weekly_earnings_in_2016',
 'gender']

In [111]:
engine = create_engine('postgresql://postgres:'+ password + '@localhost:5432/gender_pay_gap')

In [112]:
#engine.table_names()
metadata = MetaData()
metadata.reflect(bind=engine)
print(metadata.tables)

immutabledict({'pay_gap_by_race': Table('pay_gap_by_race', MetaData(bind=None), Column('id', INTEGER(), table=<pay_gap_by_race>, primary_key=True, nullable=False), Column('categoryindex', VARCHAR(length=50), table=<pay_gap_by_race>, nullable=False), Column('category', VARCHAR(length=50), table=<pay_gap_by_race>), Column('total_workers', INTEGER(), table=<pay_gap_by_race>), Column('median_weekly_earnings', INTEGER(), table=<pay_gap_by_race>), Column('year', INTEGER(), table=<pay_gap_by_race>), schema=None), 'pay_gap_by_education': Table('pay_gap_by_education', MetaData(bind=None), Column('id', INTEGER(), table=<pay_gap_by_education>, primary_key=True, nullable=False), Column('education_level', VARCHAR(length=50), table=<pay_gap_by_education>, nullable=False), Column('median_weekly_earnings_in_2018', INTEGER(), table=<pay_gap_by_education>), Column('median_weekly_earnings_in_2017', INTEGER(), table=<pay_gap_by_education>), Column('median_weekly_earnings_in_2016', INTEGER(), table=<pay_gap_by_education>), Column('gender', VARCHAR(length=50), table=<pay_gap_by_education>), schema=None)})

In [113]:
pay_gap_by_education.to_sql(name='pay_gap_by_education', con=engine, if_exists='append', index=True)